W6/D4/RoutesAndControllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE ("artworks"."artist_id" = $1 OR (artwork_shares.viewer_id = '2'))  [["artist_id", 2]]
---
  def index
    id = params[:user_id]
    accessible_artwork = Artwork
      .left_outer_joins(:shares)
      .where("artworks.artist_id = ? OR artwork_shares.viewer_id = ?", id, id)
      .distinct

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Gibby"], ["image_url", "gibby.com"], ["artist_id", 1], ["created_at", "2021-10-07 18:40:49.326656"], ["updated_at", "2021-10-07 18:40:49.326656"]]
---
  def create
    artworks = Artwork.new(artwork_params)
    if artworks.save

UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "someplaceonline.com"], ["updated_at", "2021-10-07 18:43:25.098272"], ["id", 5]]
---
  def update
    artwork = get_artwork
    if artwork.update(artwork_params)

DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 5]]
---
  def destroy
    artwork = get_artwork
    artwork.destroy

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_artwork
    Artwork.find(params[:id])