W6/D4/RoutesAndControllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (LOWER(username) LIKE LOWER('%mal%'))
SELECT "users".* FROM "users" WHERE (username LIKE '%'mal'%')
---
  def index
    search = params[:username]
    if search
      users = User.where("LOWER(username) LIKE LOWER(?)", "%#{search}%")
    else
      users = User.all

UPDATE "users" SET "email" = $1, "name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "nick@email.com"], ["name", "stuff"], ["updated_at", "2021-10-07 00:02:05.726125"], ["id", 1]]
---
  def update
    user = get_user
    if user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    user = get_user
    user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_user
    User.find(params[:id])