W7/D5/Reddit_on_Rails/app/controllers/application_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def require_moderator
    current_sub = Sub.find_by(id: params[:id])