W7/D5/Reddit_on_Rails/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @subs = current_user.subs
    @sub = @subs.where(id: params[:id]).first